# -*- coding:utf-8 -*-
#__author__:langzi
#__blog__:www.langzi.fun
import requests
import re
import time
headers = {
'Accept': 'application/json, text/javascript, */*; q=0.01',
'Accept-Encoding': 'gzip, deflate, br',
'Accept-Language': 'zh,zh-CN;q=0.9,en-US;q=0.8,en;q=0.7',
'Connection': 'keep-alive',
'Content-Length': '16',
'Content-Type': 'application/x-www-form-urlencoded; charset=UTF-8',
'Cookie':'改成你自己的',
'Host': 'www.butian.net',
'Origin': 'https://www.butian.net',
'Referer': 'ttps://www.butian.net/Loo/submit',
'User-Agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/71.0.3578.98 Safari/537.36',
'X-Requested-With': 'XMLHttpRequest'

}
def parse_data(jsons):
    data1 = jsons['data']
    print('总数量为:{}'.format(len(data1)))
    for i in data1:
        #print(i['company'])
        if i['company'].count('.')>0:
            with open('srcname技巧寻找.txt', 'a+', encoding='utf-8')as a:
                a.write(i['company'] + '\n')
        else:
            with open('企业名称技巧寻找.txt','a+',encoding='utf-8')as a:
                a.write(i['company']+'\n')

import random
keywords = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, '益', '娱', '埠', '改', '镝', '添', '洱', '纺', '入', '希', '鹿', '亚', '施', '马', '阅', '执', '街', '裕', '娃', '非', '底', '济', '邵', '璧', '保', '影', '匯', '红', '昊', '唱', '析', '蔡', '砺', '坞', '幸', '审', '叩', '绿', 'X', '恺', '肃', 'u', '圆', '書', '顶', '石', '闻', '告', '部', '琼', '现', '会', '耀', '们', '缘', '畅', '菜', '残', '翻', '爸', '克', '垫', '看', '性', '使', '与', '湖', '豆', '文', '房', '平', '辉', '雨', '外', '溯', '录', '·', '淞', '道', '饮', '凉', '达', '(', '三', '初', '州', '志', '驶', '眉', '雷', 'p', '戏', '渔', '私', '铺', '重庆', '娘', '村', '宇', '活', 'J', '棕', '豪', '息', '股份', '组', '出', '缴', '请', '委员会', '江苏', 'G', '论', '挚', '图', '霸', '拇', '泊', '德', '则', '鼎', '|', '站', '预', '农', '福建', '坏', '致', '督', '嗨', '衡', '庆', '共', '悠', '充', '经', '闺', '内', '圣', '免', '陕西', '圃', '冈', '营', '艾', '塑', '亳', '寻', '興', '跑', '铭', '律', '横', '徒', '丝', '燕', '足', ' ', '衅', '林', '恰', '莎', '澜', '松', '囤', '居', '淘', '淮', '姻', '诺', '奔', '姿', '领', '如', '欢', '岗', 'h', '杏', '3', '域', '衢', '肤', '年', '秦', '坻', '旺', '神', '冶', '旦', '唯', '购', '挂', '树', '螺', '桂', '杉', '座', '就', '彩', '荆', '梧', '凰', '\n', '鞍', '功', '江', '渡', '哈', '粮', '吉', '蒂', '喀', '溢', '弈', '东', '梯', '差', '豫', '演', '瓯', '宠', '.', '读', '得', '肥', '阔', '后', '派', '株', '戈', '沃', '续', '网站', '伯', '漾', '业', '棣', '湖北', '薇', '秋', '阁', '咪', '独', '尚', '萝', '行', '寰', '丘', '草', '鄱', '编', '多', '空', '朝', '黔', '点', '哩', '陈', '慧', '舒', '邻', '响', '姜', '遂', '涛', '懂', '份', '边', '军', '要', '大', '赞', '结', '问', '岱', '桔', '穷', '沛', '评', '七', '香', '回', '张', '兑', '峡', '蝴', '销', '鑫', '谷', '玑', '藤', '青', '频', '我', '云南', '豌', '机', '肌', '限', '蜓', '园', '锅', '2', '细', '海南', '反', '恩', '甘肃', '压', '启', '浙', '剑', '助', '针', '河北', '稳', '友', '浙江', '册', '齐', '庄', '定', '有', '雪', '培', '思', '闸', '腔', '络', '某', '目', '户', ':', '”', '缆', '承', '铃', '氏', '蒲', '检', '幺', '父', '苏', 'i', '轩', '锦', '鲱', '鄞', '谐', '余', '汇', '明', '濮', '苍', '峰', '蒙', '淄', '清', '船', '民', '慷', '巴', '蜜', '驾', '询', '芭', '邦', '荚', '儿', 'b', '鲸', '抚', '汾', '势', '南', '处', '台', '漱', '河', '板', '治', '圈', '伊', '职', '锐', '彼', '悦', '楚', '瓦', '厅', '西藏', '圳', '厨', '郎', '愿', '复', '蚁', '纽', '服', '升', '佳', '务', '货', '鸥', '咕', '巫', '震', 'W', '钧', '原', '萧', '黑', '仁', '浩', '尾', '等', '释', '《', '漂', '随', '尤', '箭', '过', '以', '浦', '魔', '甜', '快', '嘉', '音', '昌', '毕', '飓', '昭', '食', '芜', '锋', '厚', '蓝', '侨', '鞋', '积', '租', '疆', '丫', '熊', '》', '代', '遗', '架', '屋', '兖', '箱', '竞', '留', '沧', '投', '离', '奕', '小', '虎', '奇', '根', '坚', '忆', '武', '6', '新', '聪', '规', '买', '壮', '耶', '干', '向', '课', '的', '略', '涪', '金', '朔', '实', '凤', '麦', '贞', '里', 'P', '款', '傅', '5', '赛', '卓', '险', '波', '始', '坊', '森', '宸', '轨', '颢', '猫', '孜', 'U', '辰', '京', '趋', '棉', '设', '锟', '俊', '典', '庐', '婴', '太', '舞', '凡', '泸', '走', '專', '储', '平台', '鸭', '洛', '晟', '消', '汉', '送', '识', '异', '硬', '置', '莓', '样', '办', '配', '保障局', '聚', '递', '坦', '制', '陵', '海', '高', '野', '械', '放', '牧', '资', '临', '射', '试', '必', '视', '动', '闪', '渤', '体', '银', '翼', '菏', '员', '丹', '润', '皇', '陶', '观', '遣', '署', '暮', '锡', '越', '呼', '有限公司', '泛', '麻', '输', '濉', '八', '校', '垣', '激', '持', '香港', '瓜', 'L', '劳', '逐', '财', '壁', '病', '糗', 'B', '之', '休', '刀', '察', '方', '售', '朋', '久', '柱', '坐', '宿', '恒', '由', '收', '轻', '煌', '陀', '山西', '漏', '计', '矩', '牌', '7', '前', '泓', '乌', '即', '至', '饶', '究', '古', '拍', '黄', '触', '罐', '融', '终', '王', '寨', '蚯', '珠', '仑', '生', '斗', '洞', '醋', '威', '商', '佐', '河南', '力', '坡', '疗', '青海', '阆', '其', '档', '狗', '源', '训', '么', '寿', '胜', '萃', '柴', '佛', '团', '形', '华', '深', '静', '桑', '官', '产', '票', '卢', '蜕', '帮', '酷', '常', '顺', '网', '碧', '堰', '馆', '建', '型', '亩', '良', '各', '赤', '鬼', '安徽', '廊', '特', '求', '茶', '路', '修', '枢', '佣', '莲', 'e', '纷', '注', '笆', 't', '名', '鲜', '著', '盟', '世', '色', '社会保障', '莞', '妆', '表', '竹', '硅', '控', '舜', '大学', '姐', '忠', '末', '调', '学院', '邯', '洲', '玩', '鸡', '铠', '了', '准', '桥', '闵', '乡', '西', '盒', '种', '桐', '花', '咸', '胖', '跃', '滕', '椒', '摆', '人力资源', '育', '惠', '半', '萍', '弟', '鼻', '印', '两', '潭', '昱', '佰', '赢', '笑', '永', '早', '节', '按', '尼', '藏', '践', '茅', '新疆', '下', '藻', '玄', '屿', '赣', '沪', '捷', '当', '夺', '秀', '股', '梵', '望', '铜', '鸣', '器', '啡', '件', '老', '上', '光', '忌', '寺', '览', '欣', '粉', '案', '核', '你', '块', ')', '俱', '宁夏', '车', '筷', '职业', '上海', 'y', '智', '踏', '瑜', '飞', '成', '耳', '琴', '井', '诚', 'N', '班', '价', '词', '健', 'r', '擎', 'a', '振', '韵', '血', '贸', '榆', '阳', '途', '姓', '叮', '药', '迅', '什', '遵', '霞', '液', '甘', '漳', '甸', '美', '速', '策', '驻', '安', '辣', '依', '秘', '菲', '幼', '敢', '疫', '姨', '带', '无', '沙', '优', '讲', '系', '鄂', '书', '迪', '间', '梦', '睿', '吴', '人民政府', '阜', '命', '母', '伙', '找', '话', '情', '义', '牡', '虹', '亭', '呱', '淖', '阡', '社', '逸', '蚓', '遨', '停', '联', '每', '中国', '卡', '工', '管理局', '贷', '彤', '化', '到', 's', '昆', '可', '勒', '_', '左', '来', '素', '狮', '招', '五', '芊', '验', '眼', '濠', '库', '岭', '宜', '基', '身', '铻', '材', '云', '坛', '春', '穗', '照', '仕', '靜', '鸟', '啤', '伍', '爱', '莱', '献', '是', '卧', '沐', '瓣', '对', '0', '疾', 'V', '淀', '丢', '竟', '饿', '邳', '肇', '劝', '促', '分', '央', '婚', '登', '及', '山', '晴', '泄', '未', '灿', '士', '造', '兰', '伴', '荣', '础', '享', '瘦', '粒', '估', '辽', '旧', '属', '幕', '付', '醉', '腕', '樊', '泰', '期', '夜', '号', '御', '旭', '事', '先', '枣', '步', '怡', '楞', '慈', '木', '郴', '议', '墨', '禾', '关', '凌', '诃', '驱', '吐', '剂', '甲', '洁', '尊', '励', '枝', '虚', '床', '玛', '天津', '昵', '九', '纳', '个', '签', '防', '洪', '约', '萤', '境', '摄', '繁', '科技', '省', '韶', '者', '鹤', '“', '综', '糖', '冠', '芝', '群', '靖', '芦', '勘', '兽', '欧', '伽', '家', '门', '杂', '蟾', '织', '端', '瀚', '长', '朗', '铂', '加', '骑', '乐', '庭', '禄', '格', '江西', '浚', '考', '默', '普', '和', '转', '众', '湛', '微', '郸', '餐', '喉', '崇', '质', '攀', '土', '梅', '映', '矿', '测', '牛', '译', '唐', '翁', '孕', '勃', '暴', '渭', '筹', '拓', '篮', '俩', '才', '洗', 'm', '公', '崩', '意', '纱', '水', '富', '级', '心', '淼', '乒', '炫', '庚', 'x', '焕', '感', '巧', '腾', '链', '正', '抱', '摩', '媒', '标', '封', '一', '殖', '磨', '历', '侯', '互', '珂', '运', '密', '女', '榈', '头', '巢', '也', '栖', 'I', '社会', '蔚', '潮', '星', '福', '鹭', '潍', '十', '政', '扑', '晋', '直', '博', '洽', '忧', '知', '战', '然', '召', '乳', '翔', '批', '豇', '坪', '擦', '氪', '精', '信', '国', 'D', '山东', '界', '徽', '捞', '钛', '术', '额', '浮', '鹰', '纵', '颐', '白', '斑', '卫', '程', '聘', '强', '第', '袜', '这', '果', '瘤', '挖', '孚', '籍', '蜘', '蜂', '环', '盾', '用', '漠', '百', '答', '增', '片', '米', '品', '委', '许', '贤', '载', '赋', '绍', '童', '谱', '声', '闽', '晚', '延', '紫', '页', '骏', '泥', '右', '伺', '句', '拟', '去', '蛛', '赫', '沂', '-', '发', '税', '盘', '垦', '仓', '访', '采', '溜', '雅', '孝', '日', '整', '企', '祥', '吾', '帕', '渠', '完', '埔', '碟', '咖', '盖', '礼', '4', '皖', 'E', '芙', '简', '涯', '开', '君', '人才网', '兴', '杭', '章', 'j', '教', '宣', '陕', '窝', '笔', '而', '祝', 'l', '茂', '存', '味', '歪', '装', '赶', '址', '理', '漯', '蓄', '记', '柔', '线', '贵州', '自', '纯', '漫', '刊', 'F', '内蒙古', 'C', '零', '沈', '隆', '英', '唧', '通', '襄', '展', '柜', '责', '吧', '焦', '渝', '起', '迁', 'M', '贺', '妇', '昂', '中', '旁', '纬', '便', '屹', '齿', '钢', '洋', '祺', '警', '广西', '聊', '邡', '雄', '鉴', '帝', '画', '陆', '算', '物', '北', '禹', '扬', '绵', '晖', '脚', 'O', '塘', '帜', '总', '鹏', '史', '珍', '蚌', '任', '队', '沽', '进', '津', '坝', '宝', '场', '择', '碑', '碚', '司', '卜', '厂', '航', '效', '兄', '曲', '暖', '惯', '权', '煤', '胶', '沣', 'Z', '地', '冰', '钦', '仪', '）', '泉', '奎', '护', '潇', '汛', '硕', '澳门', '院', '猎', '市', '衣', '湖南', 'd', '吕', 'v', '区', '少', '电', '蚂', '变', '川', '划', '闲', '盈', '悟', '仙', '炭', '贡', '敦', '担', '教育', '浸', '玖', '重', '卷', '邮', '认', '燃', '局', '本', '元', '莼', '维', '能', '固', '秒', '佑', '布', '柏', '珊', 'f', 'k', '魂', '技', '朵', '掖', '郊', '怀', '火', '面', '像', '鸽', '蜻', '儋', '风', '宾', '猪', '六', '钻', '举', '不', '脑', '搬', '字', '广', '芒', '妙', '鲁', '港', '侠', '巅', '皮', '养', '郭', '景', '扣', '申', '散', '坤', '嘿', '附', '所', '哔', '报', '橙', '鸿', '人', '乾', '球', '梁', '交', '府', '练', '芳', '喔', '锁', '急', '瓷', '为', 'T', '二', '陇', '晶', '怒', '汽', '弘', '研', '态', '吉林', '码', '纪', '指', '层', '轮', '支', '，', '龙', '伟', '潜', '巨', '作', '番', '万', '摇', '杀', '盛', '鱼', '搜', '扶', '晨', '宽', '利', '剧', 'q', '池', '容', '/', '夏', '卫生', '协', '樱', '峪', '况', '管', '蹈', '丁', '宏', '咨', '别', '最', '备', '魅', '广东', '都', '手', '幻', '将', '帆', '浪', '亮', '篱', '懒', '台湾', '傻', '祐', '蝶', '烟', '诉', '澄', '嘟', '讼', '荔', '奶', '诸', '溪', '旗', '沭', '族', '移', '主', '集', '千', '澳', '城', '郑', '缇', '住', '窗', '位', '薯', '迈', '气', '（', '桃', '禺', '綦', '芯', '真', '掌', '盐', '葫', '歌', '璟', '喜', '言', '查', '医', '钱', 'R', '贝', '财产保险', '服务网', '全', '顿', '拜', '罗', '贪', '壹', '口', '犁', '傲', '戒', 'z', '构', '尔', '折', '酒', '技术', '滨', '赁', '舶', '宁', '狐', '兼', '黑龙江', '徐', '同', '筑', '凯', '酉', '岸', '说', '项', '塔', '袋', '携', '打', 'H', '杰', '忻', '汤', '显', '选', '斯', '孩', '数', '丽', '彦', '币', '贵', '网络科技', '值', 'K', '8', '殊', '连', '萌', '刻', '帅', '专', '堂', '贫', '喵', '蜗', '學', '喝', '柳', '尽', '四川', '传', '客', '滴', '阿', '罕', '芽', '泽', '时', '勾', '1', '游', '首', '镇', '创', '包', '超', 'c', '嘴', '式', '今', '四', '相', 'w', 'Y', '监', '娄', '周', '觉', '肿', '绥', '托', '顾', '弹', '奉', '妈', '据', '逗', '乘', '刷', '度', '障', '单', '模', '馥', '窖', '追', '舟', 'o', '兵', '塞', '宅', '辅', '那', '哪', '噻', '屯', '因', '岁', '革', '比', '黎', '凑', '拉', '9', '喂', '熟', '党', '播', '脉', '极', '吃', '田', '哥', '纸', '珀', '索', '趣', '妮', '迹', '继', '软', '潼', '艺', '版', '北京', '师', '汕', '蓟', '睛', '习', '统', '立', '透', '料', '流', '苹', '庞', '驰', 'n', '杨', '康', '誉', '厦', '柯', '善', '语', '揭', '热', '征', '集团', '陌', '听', '够', '豹', '题', '李', '鼠', '岳', '科', '费', '慕', '勤', '条', '在', '嗅', '范', '菱', '量', '列', '券', '亿', '饰', '天', '沟', '应', '讯', '旅', '卖', '饭', '邢', '哦', '扫', '莆', 'g', '彭', '埃', '翱', '辽宁', '刘', '导', '信息网', '褚', '碍', '绘', '角', '想', '萨', '月', '翠', '远', '乔', '谨', '滁', '温', '呀', '具', '县', '好', '湾', '阴', '易', '姆', '丰', '室', '返', '店', '苗', '示', '际', '学', '浏', '证', '岛', 'S', '疑', '瑞', '决', '楼', 'A', '象', '屏', '镜', '曙', '奥', '铁', '炬', '湘', '暨', '灵', '玉', '伦', '撒', '夫', '叫', '措', '子', '含', '供', '迫', '油', '合', '双', '法', '驴', '岩']


def run(keyword):
    print('当前关键词为:{}'.format(keyword))
    time.sleep(random.randint(1,5))
    url = 'https://www.butian.net/Home/Loo/getCompanyList'
    data = {
        'token': '6da620c95601c38a988617b7f811cc487e5c7150',
        'company_name': keyword
    }
    r = requests.post(url=url, data=data,headers=headers)
    # print(r.json())
    # import time
    # time.sleep(50)
    try:
        parse_data(r.json())
    except Exception as e:
        print(e)
        time.sleep(20)


for k in keywords:
    run(k)

